<?php
function str_filter($str){
 $unicode = array(
'a'=>'á|à|ả|ã|ạ|ă|ắ|ặ|ằ|ẳ|ẵ|â|ấ|ầ|ẩ|ẫ|ậ|ä|å|æ' , 
'd'=>'đ|ð', 
'e'=>'é|è|ẻ|ẽ|ẹ|ê|ế|ề|ể|ễ|ệ', 
'i'=>'í|ì|ỉ|ĩ|ị|î|ï', 
'o'=>'ó|ò|ỏ|õ|ọ|ô|ố|ồ|ổ|ỗ|ộ|ơ|ớ|ờ|ở|ỡ|ợ', 
'u'=>'ú|ù|ủ|ũ|ụ|ư|ứ|ừ|ử|ữ|ự', 
'y'=>'ý|ỳ|ỷ|ỹ|ỵ', 
'A'=>'Á|À|Ả|Ã|Ạ|Ă|Ắ|Ặ|Ằ|Ẳ|Ẵ|Â|Ấ|Ầ|Ẩ|Ẫ|Ậ|Ä|Å|Æ' , 
'D'=>'Đ', 
'E'=>'É|È|Ẻ|Ẽ|Ẹ|Ê|Ế|Ề|Ể|Ễ|Ệ|Ë', 
'I'=>'Í|Ì|Ỉ|Ĩ|Ị|Î|Ï', 
'O'=>'Ó|Ò|Ỏ|Õ|Ọ|Ô|Ố|Ồ|Ổ|Ỗ|Ộ|Ơ|Ớ|Ờ|Ở|Ỡ|Ợ', 
'U'=>'Ú|Ù|Ủ|Ũ|Ụ|Ư|Ứ|Ừ|Ử|Ữ|Ự', 
'Y'=>'Ý|Ỳ|Ỷ|Ỹ|Ỵ'
);
foreach ($unicode as $nonUnicode=>$uni){
     $str = preg_replace("/($uni)/i", $nonUnicode, $str);
}
return $str;
}
echo str_filter($_GET['str']);
?>